In [1]:
import pandas as pd
import numpy as np

In [2]:
s1 = pd.Series([1,2,3,4], index  = ['a','b','c','d'])
s2 = pd.Series([1,3,5,6,7], index = ['a','c','e','d','f'])

In [6]:
s1*s2

a     1.0
b     NaN
c     9.0
d    24.0
e     NaN
f     NaN
dtype: float64

In [7]:
df1 = pd.DataFrame({'A':[1,2]})
df2 = pd.DataFrame({'B':[3,4]})

In [8]:
df1+df2

    A   B
0 NaN NaN
1 NaN NaN

In [9]:
df1.add(df2,fill_value=0)

     A    B
0  1.0  3.0
1  2.0  4.0

In [10]:
frame = pd.DataFrame(np.random.randn(4,3), columns=list('abc'))
frame

          a         b         c
0 -1.144545  0.107534  0.544300
1 -2.085332 -2.212308  1.864033
2  1.398484 -0.156604  0.792770
3  0.700473 -1.412344  1.412569

In [11]:
np.abs(frame)

          a         b         c
0  1.144545  0.107534  0.544300
1  2.085332  2.212308  1.864033
2  1.398484  0.156604  0.792770
3  0.700473  1.412344  1.412569

In [12]:
func1 = lambda x: x.max() - x.min()
frame.apply(func1)

a    3.483816
b    2.319842
c    1.319733
dtype: float64

In [13]:
frame.apply(func1, axis=1)

0    1.688845
1    4.076341
2    1.555088
3    2.824913
dtype: float64

In [14]:
frame

          a         b         c
0 -1.144545  0.107534  0.544300
1 -2.085332 -2.212308  1.864033
2  1.398484 -0.156604  0.792770
3  0.700473 -1.412344  1.412569

In [15]:
format = lambda x: '%.2f' %x
frame.applymap(format)

       a      b     c
0  -1.14   0.11  0.54
1  -2.09  -2.21  1.86
2   1.40  -0.16  0.79
3   0.70  -1.41  1.41

In [16]:
obj = pd.Series([4,7,-3,2], index=list('dabc'))
obj.sort_index()

a    7
b   -3
c    2
d    4
dtype: int64

In [17]:
obj.sort_index(ascending=False)

d    4
c    2
b   -3
a    7
dtype: int64

In [18]:
frame.sort_values(by = 'c')

          a         b         c
0 -1.144545  0.107534  0.544300
2  1.398484 -0.156604  0.792770
3  0.700473 -1.412344  1.412569
1 -2.085332 -2.212308  1.864033

In [19]:
obj = pd.Series([7,-5,7,4,2,0,4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [20]:
obj.rank(method = 'first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [21]:
obj = pd.Series(range(5), index = list('aabbc'))
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [22]:
obj['a']
obj['c']

4

In [23]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], index=list('abcd'), columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [24]:
df.sum

<bound method NDFrame._add_numeric_operations.<locals>.sum of     one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3>

In [25]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [26]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000